## Why to use pandas??

* For data analysis
* powerful tools to handle ordered and unordered data set

## How to load csv file

In [1]:
import pandas as pd

data = pd.read_csv('Wrestler.csv')
data.tail(5)

    s.n.         Name  Wins  Loss  Draw  Gender
45  46.0        Asuka  23.0   2.0   2.0  Female
46  47.0     Carmella  17.0   7.0   1.0  Female
47  48.0       AJ Lee  57.0  11.0   9.0  Female
48  49.0      Nia Jax  15.0   1.0   0.0  Female
49  50.0  Nikki Cross  14.0   7.0   3.0  Female

In [2]:
data.drop(columns=['s.n.'],inplace=True)

In [3]:
data.head()

           Name  Wins  Loss  Draw Gender
0   Roman Reign  43.0   3.0   7.0   Male
1  Brock Lesnar  89.0  12.0  12.0   Male
2    Undertaker  75.0   9.0   8.0   Male
3      Goldberg  43.0   5.0   3.0   Male
4  Seth Rollins  34.0  10.0   3.0   Male

## Read Headers

In [4]:
data.columns

Index(['Name', 'Wins', 'Loss', 'Draw', 'Gender'], dtype='object')

## Read column

In [5]:
data[['Name','Wins']].head()

           Name  Wins
0   Roman Reign  43.0
1  Brock Lesnar  89.0
2    Undertaker  75.0
3      Goldberg  43.0
4  Seth Rollins  34.0

## Read particular data

In [6]:
data.loc[data['Name'] == "John cena"]

         Name  Wins  Loss  Draw Gender
37  John cena  93.0  11.0   5.0   Male

In [7]:
sel_data = data.iloc[39:41]
sel_data

                   Name  Wins  Loss  Draw Gender
39       The Great Kali  23.0   6.0   3.0   Male
40  Modern day Maharaja  11.0   3.0   3.0   Male

In [8]:
sel_data.reset_index(drop=True)

                  Name  Wins  Loss  Draw Gender
0       The Great Kali  23.0   6.0   3.0   Male
1  Modern day Maharaja  11.0   3.0   3.0   Male

## How can we save our new csv file

In [9]:
sel_data.to_csv("Indian_wrestler.csv",index=False)

In [10]:
sel_data

                   Name  Wins  Loss  Draw Gender
39       The Great Kali  23.0   6.0   3.0   Male
40  Modern day Maharaja  11.0   3.0   3.0   Male

In [11]:
data.head(10)

           Name  Wins  Loss  Draw Gender
0   Roman Reign  43.0   3.0   7.0   Male
1  Brock Lesnar  89.0  12.0  12.0   Male
2    Undertaker  75.0   9.0   8.0   Male
3      Goldberg  43.0   5.0   3.0   Male
4  Seth Rollins  34.0  10.0   3.0   Male
5  Dean Ambrose  31.0  10.0   5.0   Male
6  Sawn Michael  67.0  11.0  13.0   Male
7         Rusev  23.0   7.0   3.0   Male
8      The Rock  78.0  13.0  18.0   Male
9      Triple H  71.0  18.0   9.0   Male

In [12]:
data.iloc[0,0]

'Roman Reign'

In [13]:
data.iloc[3,0]

'Goldberg'

## Sorting our data

In [14]:
data.sort_values('Wins').head(5)

                   Name  Wins  Loss  Draw  Gender
40  Modern day Maharaja  11.0   3.0   3.0    Male
49          Nikki Cross  14.0   7.0   3.0  Female
48              Nia Jax  15.0   1.0   0.0  Female
46             Carmella  17.0   7.0   1.0  Female
26       Brawn Strowman  18.0   2.0   2.0    Male

In [15]:
data.sort_values('Wins', ascending=False).head(5)

            Name  Wins  Loss  Draw Gender
37     John cena  93.0  11.0   5.0   Male
1   Brock Lesnar  89.0  12.0  12.0   Male
32      Booker T  88.0  21.0  11.0   Male
16       CM punk  88.0  13.0   6.0   Male
22      Big show  87.0  11.0   2.0   Male

In [16]:
data.sort_values(['Wins','Loss'], ascending=[1,0]).head(5)

                   Name  Wins  Loss  Draw  Gender
40  Modern day Maharaja  11.0   3.0   3.0    Male
49          Nikki Cross  14.0   7.0   3.0  Female
48              Nia Jax  15.0   1.0   0.0  Female
46             Carmella  17.0   7.0   1.0  Female
26       Brawn Strowman  18.0   2.0   2.0    Male

## How can we make changes to the csv file

In [17]:
data.head()

           Name  Wins  Loss  Draw Gender
0   Roman Reign  43.0   3.0   7.0   Male
1  Brock Lesnar  89.0  12.0  12.0   Male
2    Undertaker  75.0   9.0   8.0   Male
3      Goldberg  43.0   5.0   3.0   Male
4  Seth Rollins  34.0  10.0   3.0   Male

In [18]:
data['Total Matches']=data['Wins']+data['Loss']+data['Draw']
data.head()

           Name  Wins  Loss  Draw Gender  Total Matches
0   Roman Reign  43.0   3.0   7.0   Male           53.0
1  Brock Lesnar  89.0  12.0  12.0   Male          113.0
2    Undertaker  75.0   9.0   8.0   Male           92.0
3      Goldberg  43.0   5.0   3.0   Male           51.0
4  Seth Rollins  34.0  10.0   3.0   Male           47.0

In [19]:
data.drop(columns=['Total Matches']).head()

           Name  Wins  Loss  Draw Gender
0   Roman Reign  43.0   3.0   7.0   Male
1  Brock Lesnar  89.0  12.0  12.0   Male
2    Undertaker  75.0   9.0   8.0   Male
3      Goldberg  43.0   5.0   3.0   Male
4  Seth Rollins  34.0  10.0   3.0   Male

In [20]:
data['Total Matches']=data.iloc[:,1:4].sum(axis=1)
data.head()

           Name  Wins  Loss  Draw Gender  Total Matches
0   Roman Reign  43.0   3.0   7.0   Male           53.0
1  Brock Lesnar  89.0  12.0  12.0   Male          113.0
2    Undertaker  75.0   9.0   8.0   Male           92.0
3      Goldberg  43.0   5.0   3.0   Male           51.0
4  Seth Rollins  34.0  10.0   3.0   Male           47.0

In [21]:
import numpy as np
data.loc[50]=(['Ishwar',100,1,0,'Male',np.nan])

In [22]:
data.tail()

           Name   Wins  Loss  Draw  Gender  Total Matches
46     Carmella   17.0   7.0   1.0  Female           25.0
47       AJ Lee   57.0  11.0   9.0  Female           77.0
48      Nia Jax   15.0   1.0   0.0  Female           16.0
49  Nikki Cross   14.0   7.0   3.0  Female           24.0
50       Ishwar  100.0   1.0   0.0    Male            NaN

In [23]:
data.dropna(axis=0).tail()

           Name  Wins  Loss  Draw  Gender  Total Matches
45        Asuka  23.0   2.0   2.0  Female           27.0
46     Carmella  17.0   7.0   1.0  Female           25.0
47       AJ Lee  57.0  11.0   9.0  Female           77.0
48      Nia Jax  15.0   1.0   0.0  Female           16.0
49  Nikki Cross  14.0   7.0   3.0  Female           24.0

## How to create our own dataset

In [27]:
data = pd.DataFrame(
    [['Ishwar',24,'Butwal'],
     ['Bijay',26,'Kathmandu'],
     ['Manish',23,'Nepalgunj'],
     ['Pradeep',20,'Dang']],
     index=[0,1,2,3],
     columns = ['Name','Age','Place'])
print(data)

      Name  Age      Place
0   Ishwar   24     Butwal
1    Bijay   26  Kathmandu
2   Manish   23  Nepalgunj
3  Pradeep   20       Dang

In [29]:
data.to_csv('My_dataset.csv',index=False)

In [31]:
data = pd.read_csv("My_dataset.csv")
data

      Name  Age      Place
0   Ishwar   24     Butwal
1    Bijay   26  Kathmandu
2   Manish   23  Nepalgunj
3  Pradeep   20       Dang

In [35]:
data.describe()

         Age
count   4.00
mean   23.25
std     2.50
min    20.00
25%    22.25
50%    23.50
75%    24.50
max    26.00

In [36]:
data.count()

Name     4
Age      4
Place    4
dtype: int64

In [37]:
data.values

array([['Ishwar', 24, 'Butwal'],
       ['Bijay', 26, 'Kathmandu'],
       ['Manish', 23, 'Nepalgunj'],
       ['Pradeep', 20, 'Dang']], dtype=object)